cr1901/msp430g2xx/svds/msp430g2x52.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TLV_CALIBRATION_DATA</name>
      <description>TLV Calibration Data</description>
      <baseAddress>4288</baseAddress>
      <registers>
        <register>
          <name>TLV_ADC10_1_TAG</name>
          <description>TLV ADC10_1 TAG</description>
          <addressOffset>26</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>TLV_ADC10_1_TAG</name>
              <description>TLV ADC10_1 TAG register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TLV_ADC10_1_LEN</name>
          <description>TLV ADC10_1 LEN</description>
          <addressOffset>27</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>TLV_ADC10_1_LEN</name>
              <description>TLV ADC10_1 LEN register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TLV_DCO_30_TAG</name>
          <description>TLV TAG_DCO30 TAG</description>
          <addressOffset>54</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>TLV_DCO_30_TAG</name>
              <description>TLV TAG_DCO30 TAG register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TLV_DCO_30_LEN</name>
          <description>TLV TAG_DCO30 LEN</description>
          <addressOffset>55</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>TLV_DCO_30_LEN</name>
              <description>TLV TAG_DCO30 LEN register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TLV_CHECKSUM</name>
          <description>TLV CHECK SUM</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>TLV_CHECKSUM</name>
              <description>TLV CHECK SUM register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CALIBRATION_DATA</name>
      <description>Calibration Data</description>
      <baseAddress>4344</baseAddress>
      <registers>
        <register>
          <name>CALDCO_16MHZ</name>
          <description>DCOCTL  Calibration Data for 16MHz</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>CALDCO_16MHZ</name>
              <description>DCOCTL  Calibration Data for 16MHz register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CALBC1_16MHZ</name>
          <description>BCSCTL1 Calibration Data for 16MHz</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>CALBC1_16MHZ</name>
              <description>BCSCTL1 Calibration Data for 16MHz register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CALDCO_12MHZ</name>
          <description>DCOCTL  Calibration Data for 12MHz</description>
          <addressOffset>2</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>CALDCO_12MHZ</name>
              <description>DCOCTL  Calibration Data for 12MHz register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CALBC1_12MHZ</name>
          <description>BCSCTL1 Calibration Data for 12MHz</description>
          <addressOffset>3</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>CALBC1_12MHZ</name>
              <description>BCSCTL1 Calibration Data for 12MHz register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CALDCO_8MHZ</name>
          <description>DCOCTL  Calibration Data for 8MHz</description>
          <addressOffset>4</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>CALDCO_8MHZ</name>
              <description>DCOCTL  Calibration Data for 8MHz register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CALBC1_8MHZ</name>
          <description>BCSCTL1 Calibration Data for 8MHz</description>
          <addressOffset>5</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>CALBC1_8MHZ</name>
              <description>BCSCTL1 Calibration Data for 8MHz register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CALDCO_1MHZ</name>
          <description>DCOCTL  Calibration Data for 1MHz</description>
          <addressOffset>6</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>CALDCO_1MHZ</name>
              <description>DCOCTL  Calibration Data for 1MHz register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CALBC1_1MHZ</name>
          <description>BCSCTL1 Calibration Data for 1MHz</description>
          <addressOffset>7</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>CALBC1_1MHZ</name>
              <description>BCSCTL1 Calibration Data for 1MHz register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
